aboutNginx/nginxSetup.org
#+TITLE: nginx的安装部署

* 概述
对比了apache和nginx，如果项目是纯html，推荐使用nginx
* redhat
** 安装
*** 准备工作
1. 操作系统red hat 6.4
2. 下载nginx的源码包，选择当前稳定版，(nginx-1.10.2.tar.gz) http://nginx.org/en/download.html 
3. 用root用户，解压源码包
*** 编译安装
#+BEGIN_SRC
./configure --user=qzt_nginx --group=nginx --with-http_ssl_module
make
make install
#+END_SRC
** 配置nginx
#+BEGIN_SRC
#nginx.conf
#以下只列出了有变动的行
server {
  listen 36886
  location / {
    root /home/qzt_nginx/html
  }
}
#+END_SRC
** 添加用户
#+BEGIN_SRC
groupadd nginx
useradd -g nginx -s /bin/bash -m qzt_nginx
#修改用户组
usermod -g nginx qzt_nginx
#+END_SRC
** 启动
root用户执行/usr/local/nginx/sbin/nginx
* centos
** 安装
*** 添加用户
#+BEGIN_SRC
groupadd nginx
useradd -g nginx -s /bin/bash -m qzt_nginx
#+END_SRC
*** 安装需要的编译工具
#+BEGIN_SRC
su - root
rpm -ivh mpfr-2.4.1-6.el6.x86_64.rpm
rpm -ivh cpp-4.4.7-4.el6.x86_64.rpm
rpm -ivh ppl-0.10.2-11.el6.x86_64.rpm
rpm -ivh cloog-ppl-0.15.7-1.2.el6.x86_64.rpm
rpm -ivh gcc-4.4.7-4.el6.x86_64.rpm
rpm -ivh pcre-7.8-6.el6.x86_64.rpm
rpm -ivh pcre-devel-7.8-6.el6.x86_64.rpm
#+END_SRC
*** 编译nginx
#+BEGIN_SRC
#所有操作要在qzt_nginx用户下
su - qzt_nginx
./configure --prefix=/home/qzt_nginx/nginx --user=qzt_nginx --group=nginx --with-http_ssl_module
make
make install
#+END_SRC
