aboutNginx/nginxSetup.html
<!doctype html>
<html lang="en">
<head>
<title>nginx的安装部署</title>
<!-- 2017-01-13 Fri 10:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="赵光建">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">nginx的安装部署</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
对比了apache和nginx，如果项目是纯html，推荐使用nginx
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> redhat</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 安装</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 准备工作</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>操作系统red hat 6.4
</li>
<li>下载nginx的源码包，选择当前稳定版，(nginx-1.10.2.tar.gz) <a href="http://nginx.org/en/download.html">http://nginx.org/en/download.html</a> 
</li>
<li>用root用户，解压源码包
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> 编译安装</h4>
<div class="outline-text-4" id="text-2-1-2">
<pre class="example">
./configure --user=qzt_nginx --group=nginx --with-http_ssl_module
make
make install
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 配置nginx</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
#nginx.conf
#以下只列出了有变动的行
server {
  listen 36886
  location / {
    root /home/qzt_nginx/html
  }
}
</pre>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 添加用户</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
groupadd nginx
useradd -g nginx -s /bin/bash -m qzt_nginx
#修改用户组
usermod -g nginx qzt_nginx
</pre>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 启动</h3>
<div class="outline-text-3" id="text-2-4">
<p>
root用户执行/usr/local/nginx/sbin/nginx
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> centos</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 安装</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 添加用户</h4>
<div class="outline-text-4" id="text-3-1-1">
<pre class="example">
groupadd nginx
useradd -g nginx -s /bin/bash -m qzt_nginx
</pre>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 安装需要的编译工具</h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
su - root
rpm -ivh mpfr-2.4.1-6.el6.x86_64.rpm
rpm -ivh cpp-4.4.7-4.el6.x86_64.rpm
rpm -ivh ppl-0.10.2-11.el6.x86_64.rpm
rpm -ivh cloog-ppl-0.15.7-1.2.el6.x86_64.rpm
rpm -ivh gcc-4.4.7-4.el6.x86_64.rpm
rpm -ivh pcre-7.8-6.el6.x86_64.rpm
rpm -ivh pcre-devel-7.8-6.el6.x86_64.rpm
</pre>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> 编译nginx</h4>
<div class="outline-text-4" id="text-3-1-3">
<pre class="example">
#所有操作要在qzt_nginx用户下
su - qzt_nginx
./configure --prefix=/home/qzt_nginx/nginx --user=qzt_nginx --group=nginx --with-http_ssl_module
make
make install
</pre>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. 概述</a></li>
<li><a href="#sec-2">2. redhat</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. 安装</a></li>
<li><a href="#sec-2-2">2.2. 配置nginx</a></li>
<li><a href="#sec-2-3">2.3. 添加用户</a></li>
<li><a href="#sec-2-4">2.4. 启动</a></li>
</ul>
</li>
<li><a href="#sec-3">3. centos</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. 安装</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 赵光建</p>
<p class="date">Created: 2017-01-13 Fri 10:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
